snlkuharlocal/src/Enums/УсловияОплаты/УсловияОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УсловияОплаты</name>
  <enumValues>
    <name>Предоплата</name>
  </enumValues>
  <enumValues>
    <name>Отсрочка</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/Договоры/Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры</name>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаКредита</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>EnumRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежа</name>
    <type>
      <types>CatalogRef.ОтсрочкиПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЦБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодБух</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПроцентовПоКредиту</name>
    <type>
      <types>EnumRef.СпособыРасчетаПроцентовПоКредиту</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПоКредиту</name>
    <comment>Процент по кредиту (Периодический реквизит)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора_Новый</name>
    <type>
      <types>CatalogRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСоглашение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КассовыйДоговорТЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>CatalogRef.КодыПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиСБ</name>
    <comment>Процент скидки для сезонного бонусуа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИспользованияДоговоров</name>
    <comment>0 - указыввается вручную, 1 - расчеты по счетам, 2 - используется основной договор</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетДляОплаты</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьМатрицу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСкановДоговоров</name>
    <type>
      <types>EnumRef.СостоянияСкановДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАрхивнойКоробки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПроверкиСБ</name>
    <type>
      <types>CatalogRef.РезультатыПроверкиСБ</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованоБухгалтерией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАСФ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическоеПлечо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеФайлы</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ДополнительныеФайлыДоговора</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/CommonModules/ВзаиморасчетыС/Module.bsl
Функция УстановитьДЗРпоДДСпоАвансам(Дата) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	БылаДата = Константы.ДатаЗапретаРедактированияДДСпоАвансовымДоговорам.Получить();
	Константы.ДатаЗапретаРедактированияДДСпоАвансовымДоговорам.Установить(Дата);
	
	ТекстЛога		= СтрШаблон("Изменена ДЗР по ДДС по авансам. Старая дата: %1, новая дата: %2.", Формат(БылаДата, "ДФ=dd.MM.yyyy"), Формат(Дата, "ДФ=dd.MM.yyyy"));
	ТипСообщения	= ТипСообщенияЖурнала(БылаДата, Дата);
	
	ЗаписатьВЛог("Авансы покупателей", ТекстЛога, ТипСообщения); 
КонецФункции //УстановитьДЗРпоДДСпоАвансам(Дата) Экспорт

Функция УстановитьДЗРпоРНКпоАвансам(Дата) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	БылаДата = Константы.ДатаЗапретаРедактированияРНКпоАвансовымДоговорам.Получить();
	Константы.ДатаЗапретаРедактированияРНКпоАвансовымДоговорам.Установить(Дата);
	
	ТекстЛога		= СтрШаблон("Изменена ДЗР по РНК по авансам. Старая дата: %1, новая дата: %2.", Формат(БылаДата, "ДФ=dd.MM.yyyy"), Формат(Дата, "ДФ=dd.MM.yyyy"));
	ТипСообщения	= ТипСообщенияЖурнала(БылаДата, Дата);
	
	ЗаписатьВЛог("Авансы покупателей", ТекстЛога, ТипСообщения); 
КонецФункции //УстановитьДЗРпоРНКпоАвансам(Дата) Экспорт

Функция ТипСообщенияЖурнала(СтараяДата, НоваяДата)
	Возврат ?(НоваяДата < СтараяДата, "Предупреждение", "Информация");
КонецФункции //ТипСообщенияЖурнала(СтараяДата, НоваяДата)

Функция ПолучитьАвансовыеДоговора(ДоговораСсылки) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ	
	|	Ссылка
	|ИЗ
	|	Справочник.Договоры
	|ГДЕ
	|	Ссылка В (&ДоговораСсылки)
	|	И УсловияОплаты = ЗНАЧЕНИЕ(Перечисление.УсловияОплаты.Предоплата)
	|	И ВидДоговора_Новый = ЗНАЧЕНИЕ(Справочник.ВидыДоговоров.Товары_Продажа)
	|";		
	
	Запрос.УстановитьПараметр("ДоговораСсылки", ДоговораСсылки);
	
	АвансовыеДоговора = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		АвансовыеДоговора[Выборка.Ссылка] = Истина;
	КонецЦикла;
	
	Возврат АвансовыеДоговора;
КонецФункции //ПолучитьАвансовыеДоговора(мДоговора) Экспорт
